/*
push ebp
xor edx, edx
mov ebp, esp
push edi
push esi
lea edi, [ebp - 0x5ac]
mov esi, ref_fffc9e38  ; mov esi, 0xfffc9e38
push ebx
mov ebx, 0xd
lea esp, [esp - 0x65c]
mov ecx, ebx
mov dword [ebp - 0x63c], eax
mov al, dl
rep stosb  ; rep stosb byte es:[edi], al
mov ebx, ecx
mov ecx, dword [ebp - 0x63c]
lea edi, [ebp - 0x59f]
mov dword [ebp - 0x5dc], 0
mov dword [ebp - 0x5d8], 0
mov dword [ebp - 0x5d4], 0
mov dword [ebp - 0x5d0], fcn_fffa10c8  ; mov dword [ebp - 0x5d0], 0xfffa10c8
mov byte [ebp - 0x60a], 1
mov eax, dword [ecx + 0x1e]
mov ecx, 0xd
mov dword [ebp - 0x609], eax
mov al, dl
rep stosb  ; rep stosb byte es:[edi], al
lea eax, [ebp - 0x59f]
lea edi, [ebp - 0x635]
mov dword [ebp - 0x5c8], eax
mov cl, 3
mov al, dl
mov dword [ebp - 0x5cc], 1
rep stosb  ; rep stosb byte es:[edi], al
lea edi, [ebp - 0x605]
mov cl, 5
rep stosb  ; rep stosb byte es:[edi], al
mov eax, dword [ebp - 0x63c]
lea edi, [ebp - 0x508]
mov byte [ebp - 0x635], 2
mov byte [ebp - 0x633], 1
mov eax, dword [eax + 0x42]
mov dword [ebp - 0x664], eax
mov al, byte [ebp - 0x605]
mov cl, byte [ebp - 0x664]
and eax, 0xfffffffe
and ecx, 1
or eax, ecx
mov ecx, dword [ebp - 0x63c]
mov byte [ebp - 0x605], al
mov eax, dword [ecx + 0x2e]
mov ecx, 8
mov dword [ebp - 0x604], eax
mov eax, ebx
rep stosd  ; rep stosd dword es:[edi], eax
mov al, dl
lea edi, [ebp - 0x403]
mov cl, 0xc3
rep stosb  ; rep stosb byte es:[edi], al
mov byte [ebp - 0x403], 1
mov eax, dword [ebp - 0x63c]
lea edi, [ebp - 0x632]

movzx eax, al
cmp ebx, eax
jl short loc_fffa3b4e
jmp near loc_fffa3ab5

loc_fffa3bb5:
cmp eax, 2
jne loc_fffa3ab5
jmp short loc_fffa3c1b  ; jmp 0xfffa3c1b

loc_fffa3bc0:
imul eax, ebx, 6
lea esi, [ebp + eax - 0x402]
mov al, byte [esi + 1]
cmp al, 3
sete cl
test al, al
sete dl
or cl, dl
je short loc_fffa3bf3
mov ax, word [esi + 2]
cmp ax, 0x6f
ja short loc_fffa3be7
jmp short loc_fffa3c0a

loc_fffa3be7:
cmp ax, 0xff
mov byte [esi + 4], 6
ja short loc_fffa3c14  ; ja 0xfffa3c14
jmp short loc_fffa3c0e  ; jmp 0xfffa3c0e

loc_fffa3bf3:
cmp al, 2
jne short loc_fffa3c0a  ; jne 0xfffa3c0a
cmp word [esi + 2], 0x50
mov byte [esi + 4], 4
sbb eax, eax
add eax, 2
mov byte [esi + 5], al
jmp short loc_fffa3c18

loc_fffa3c0a:
mov byte [esi + 4], 5

loc_fffa3c0e:
mov byte [esi + 5], 2
jmp short loc_fffa3c18  ; jmp 0xfffa3c18

loc_fffa3c14:
mov byte [esi + 5], 3

loc_fffa3c18:
inc ebx
jmp short loc_fffa3c1d  ; jmp 0xfffa3c1d

loc_fffa3c1b:
xor ebx, ebx

loc_fffa3c1d:
call fcn_fffc5d89  ; call 0xfffc5d89
movzx eax, al
cmp ebx, eax
jl short loc_fffa3bc0  ; jl 0xfffa3bc0
jmp near loc_fffa3ab5

loc_fffa3c2e:
mov eax, dword [edx + 0x3410]
or eax, 0x10
mov dword [edx + 0x3410], eax
mov eax, dword [edx + 0x3410]
in al, 0x70
mov esi, eax
mov eax, dword [edx + 0x3410]
and eax, 0xffffffef
and esi, 0xffffff80
mov dword [edx + 0x3410], eax
mov ecx, esi
mov eax, dword [edx + 0x3410]
or ecx, 0xa
mov al, cl
out 0x70, al
in al, 0x71
and eax, 0xffffff8f
or eax, 0x60
out 0x71, al
or esi, 0xb
mov eax, esi
out 0x70, al
in al, 0x71
or eax, 0xffffff80
out 0x71, al
mov al, cl
out 0x70, al
in al, 0x71
and eax, 0xffffff8f
or eax, 0x20
out 0x71, al
mov eax, esi
out 0x70, al
in al, 0x71
and eax, 0x7f
out 0x71, al

loc_fffa3c99:
mov dword [edx + 0x3310], 0x10
mov eax, ebx
call fcn_fffc7c9d  ; call 0xfffc7c9d
mov eax, 0xc
call mrc_alloc
test eax, eax
mov esi, eax
je short loc_fffa3d32  ; je 0xfffa3d32
mov edx, 0xc
call mrc_zeromem
mov eax, 0x28
call mrc_alloc
test eax, eax
mov edi, eax
je short loc_fffa3d32  ; je 0xfffa3d32
mov edx, 0x28
call mrc_zeromem
mov ecx, 0x28
mov edx, ref_fffcc8dc  ; mov edx, 0xfffcc8dc
mov eax, edi
call mrc_memcpy
mov dword [esi + 8], edi
mov dword [esi], 0x80000010
mov dword [esi + 4], ref_fffcd534  ; mov dword [esi + 4], 0xfffcd534
push edi
push edi
mov eax, dword [ebx]
push esi
push ebx
call dword [eax + 0x18]  ; ucall
pop eax
pop edx
mov eax, dword [ebx]
push ref_fffcc97c  ; push 0xfffcc97c
push ebx
call dword [eax + 0x18]  ; ucall
pop ecx
pop esi
mov eax, dword [ebx]
push ref_fffcca30  ; push 0xfffcca30
push ebx
call dword [eax + 0x24]  ; ucall
pop edi
pop eax
mov eax, dword [ebx]
push ref_fffcd560  ; push 0xfffcd560
push ebx
call dword [eax + 0x24]  ; ucall
add esp, 0x10

loc_fffa3d32:
push ecx
push 0
push 0
push dword [0xff7d7538]
call fcn_fffb9720  ; call 0xfffb9720
mov dword [esp], ref_fffcc5e7  ; 'System Agent: Initializing PCH (SMBUS)',0x0a,0x00
call mrc_printk  ; call 0xfffa1253
*/
ref_fffc9e38:
dd fcn_fffaea18
dd fcn_fffc5978
dd fcn_fffc5d49
dd fcn_fffc7bc0

struct usb2_port_setting {
	uint16_t length;
	uint8_t enable;
	uint8_t over_current_pin;
	uint8_t location;
} __packed;

struct usb3_port_setting {
	uint8_t enable;
	uint8_t over_current_pin;
} __packed;

struct pei_data
{
  uint32_t pei_version; // 0
  uint32_t mchbar; // 4
  uint32_t dmibar; // 8
  uint32_t epbar; // c
  uint32_t pciexbar; // 0x10
  uint16_t smbusbar; // 0x14
  uint32_t wdbbar; // 0x16
  uint32_t wdbsize; // 0x1a
  uint32_t hpet_address; // 0x1e
  uint32_t rcba; // 0x22
  uint32_t pmbase; // 0x26
  uint32_t gpiobase; // 0x2a
  uint32_t temp_mmio_base; // 0x2e
  uint32_t system_type; // 0x32, 0 Mobile, 1 Desktop/Server
  uint32_t tseg_size; // 0x36
  uint8_t spd_addresses[4]; // 0x3a
  int boot_mode; // 0x3e
  int ec_present; // 0x42
  int gbe_enable; // 0x46
  // 0 = leave channel enabled
  // 1 = disable dimm 0 on channel
  // 2 = disable dimm 1 on channel
  // 3 = disable dimm 0+1 on channel
  int dimm_channel0_disabled; // 0x4a
  int dimm_channel1_disabled; // 0x4e
  /* Enable 2x Refresh Mode */
  int ddr_refresh_2x; // 0x52
  int dq_pins_interleaved; // 0x56
  /* Data read from flash and passed into MRC */
  unsigned char *mrc_input; // 0x5a
  unsigned int mrc_input_len; // 0x5e
  /* Data from MRC that should be saved to flash */
  unsigned char *mrc_output; // 0x62
  unsigned int mrc_output_len; // 0x66
  /*
   * Max frequency DDR3 could be ran at. Could be one of four values: 800,
   * 1067, 1333, 1600
   */
  uint32_t max_ddr3_freq; // 0x6a
  /* Route all USB ports to XHCI controller in resume path */
  int usb_xhci_on_resume; // 0x6e

  // 0x72, 0x77, 0x7c, 0x81, 0x86, 0x8b, 0x90, 0x95
  // 0x9a, 0x9f, 0xa4, 0xa9, 0xae, 0xb3, 0xb8, 0xbd
  struct usb2_port_setting usb2_ports[MAX_USB2_PORTS];

  // 0xc2, 0xc4, 0xc6, 0xc8, 0xca, 0xcc, 0xce, 0xd0
  // 0xd2, 0xd4, 0xd6, 0xd8, 0xda, 0xdc, 0xde, 0xe0
  struct usb3_port_setting usb3_ports[MAX_USB3_PORTS];
  
  uint8_t spd_data[4][256]; // 0xe2, 0x1e2, 0x2e2, 0x3e2
  tx_byte_func tx_byte; // 0x4e2
} __packed;

struct usb2_setting
{
  uint8_t en;
  uint8_t location;
  uint16_t length;
  uint8_t f4;
  uint8_t f5;
};

static *PeiCore; // 0xff7d7538
int __attribute((regparm(1))) do_raminit(struct pei_data *pd)
{
  struct pei_data *pei; // ebp - 0x63c
  edx = 0;
  edi = ebp - 0x5ac;
  esi = ref_fffc9e38;
  ebx = 13;
  ecx = ebx;
  [ebp - 0x63c] = pd;
  zeromem(edi, 13);
  ebx = 0;
  ecx = pei;
  edi = ebp - 0x59f;
  [ebp - 0x5dc] = [ebp - 0x5d8] = [ebp - 0x5d4] = 0;
  [ebp - 0x5d0] = fcn_fffa10c8;
  byte [ebp - 0x60a] = 1;
  eax = pei->hpet_address;
  ecx = 13;
  [ebp - 0x609] = eax;
  zeromem(edi, 13);
  eax = ebp - 0x59f;
  edi = ebp - 0x635;
  [ebp - 0x5c8] = eax;
  cl = 3;
  [ebp - 0x5cc] = 1;
  zeromem(edi, 3);
  edi = ebp - 0x605;
  zeromem(edi, 5);
  eax = pei;
  edi = ebp - 0x508;
  byte [ebp - 0x635] = 2;
  byte [ebp - 0x633] = 1;
  [ebp - 0x664] = pei->ec_present;
  eax = byte [ebp - 0x605] & 0xfffffffe;
  ecx = byte [ebp - 0x664] & 1;
